tasks = {
    'D6': {
        'description': 'საპენსიო ასაკის (65+) მამაკაცების რაოდენობა ოჯახში',
        'codes': {},
        'actions': [6, 7, 8],
        'index': 'D6_პენსიონერი კაცი'
    },
    'E2': {
        'description': 'ვის ეკუთვნის საცხოვრისი, რომელშიც ოჯახი ცხოვრობს',
        'codes': {
            1: 'ეკუთვნის შინამეურნეობას',
            2: 'დაქირავებულია',
            3: 'დაგირავებულია',
            4: 'უფასო სარგებლობაშია'
        },
        'actions': [2, 4],
        'index': 'E2_სახლის მფლობელი'
    },
    'F22': {
        'description': 'გაზქურების/ელექტროქურების რაოდენობა ოჯახში',
        'codes': {},
        'actions': [6, 7, 8],
        'index': 'F22'
    },
    'S3': {
        'description': 'რამდენი ლარი სჭირდება თვეში, თქვენს ოჯახს სურსათისა და სხვა აუცილებელი ხარჯებისათვის',
        'codes': {},
        'actions': [3, 6, 7, 8],
        'index': 'S3'
    },
    'I4': {
        'description': 'ოჯახის შემოსავლები ქონების გაქირავებიდან(საშუალოდ თვეში)',
        'codes': {},
        'actions': [3, 5, 6, 7, 8, 10],
        'index': 'I4_ქონებიდან',
        'additional_index': 'I8_ფულადი_სახსრები'
    },
    'C5': {
        'description': 'ოჯახის დანახარჯები საწვავზე და ელექტროენერგიაზე (ლარი, საშუალოდ თვეში)',
        'codes': {},
        'actions': [3, 5, 6, 7, 8, 10],
        'index': 'C5_ენერგია',
        'additional_index': 'C8_ფულადი ხარჯები'
    }
}

actions = {
    'სიხშირული განაწილება': 1,
    'სვეტოვანი დიაგრამა': 2,
    'ხაზოვანი დიაგრამა': 3,
    'წრიული დიაგრამა': 4,
    'გაბნევის დიაგრამა': 5,
    'საშუალო': 6,
    'მედიანა': 7,
    'მოდა': 8,
    'დისპერსია': 9,
    'კორელაციის კოეფიციენტი': 10
}
